src/cfe/InformationRegisters/кбп_КнопкиШагов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>кбп_КнопкиШагов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_ВидыКнопок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подтверждение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстПодтверждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийОбязателен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_ВидыДействий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдПерехода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидОбработчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_ВидыОбработчиков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ОбработчикиПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВложеннаяСхема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_СхемыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УсловиеВидимости</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеДоступности</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦепочкаДействий</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Шаг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ЭлементыСхем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдКнопки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/Enums/кбп_ВидыКнопок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>кбп_ВидыКнопок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Основная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обычная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опасная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_ВидыДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кбп_ВидыДействий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Переход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вернуть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переадресовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОткрытьФорму</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапуститьВложенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прервать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_ТипыШагов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кбп_ТипыШагов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Старт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Условие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборВарианта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вариант</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слияние</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВложенныйПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Таймер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оповещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декорация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_ВидыУсловий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кбп_ВидыУсловий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отбор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выражение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Catalogs/кбп_ОбработчикиПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>кбп_ОбработчикиПроцессов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяМетода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/CommonModules/кбп_Действия/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Кнопки шага (Архитектура п. 8.1).
// Кнопки из кбп_КнопкиШагов; если их нет — по кнопке на каждую линию из задачи (подпись линии),
// а при одной линии — «Выполнено». При разрешённом возврате добавляется «Вернуть на доработку».
//
// Параметры:
//  Шаг - СправочникСсылка.кбп_ЭлементыСхем
//
// Возвращаемое значение:
//  ТаблицаЗначений - ИдКнопки, Заголовок, Вид, Действие, ИдПерехода, Подтверждение, ТекстПодтверждения,
//                    КомментарийОбязателен, Обработчик, Порядок, ИмяФормы, ВложеннаяСхема, УсловиеВидимости,
//                    УсловиеДоступности, Доступна (для КнопкиЗадачи).
//
Функция КнопкиШага(Шаг) Экспорт

	Кнопки = НоваяТаблицаКнопок();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Шаг", Шаг);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Кнопки.ИдКнопки КАК ИдКнопки,
	|	Кнопки.Заголовок КАК Заголовок,
	|	Кнопки.Вид КАК Вид,
	|	Кнопки.Действие КАК Действие,
	|	Кнопки.ИдПерехода КАК ИдПерехода,
	|	Кнопки.Подтверждение КАК Подтверждение,
	|	Кнопки.ТекстПодтверждения КАК ТекстПодтверждения,
	|	Кнопки.КомментарийОбязателен КАК КомментарийОбязателен,
	|	Кнопки.Обработчик КАК Обработчик,
	|	Кнопки.Порядок КАК Порядок,
	|	Кнопки.ИмяФормы КАК ИмяФормы,
	|	Кнопки.ВложеннаяСхема КАК ВложеннаяСхема,
	|	Кнопки.УсловиеВидимости КАК УсловиеВидимости,
	|	Кнопки.УсловиеДоступности КАК УсловиеДоступности
	|ИЗ
	|	РегистрСведений.кбп_КнопкиШагов КАК Кнопки
	|ГДЕ
	|	Кнопки.Шаг = &Шаг
	|
	|УПОРЯДОЧИТЬ ПО
	|	Кнопки.Порядок";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Кнопки.Добавить(), Выборка);
	КонецЦикла;

	Если Кнопки.Количество() = 0 Тогда
		ДобавитьКнопкиПоЛиниям(Кнопки, Шаг);
	КонецЕсли;

	Если Шаг.РазрешенВозврат Тогда
		Кнопка = Кнопки.Добавить();
		Кнопка.ИдКнопки = ИдКнопкиВозврата();
		Кнопка.Заголовок = НСтр("ru = 'Вернуть на доработку'");
		Кнопка.Вид = Перечисления.кбп_ВидыКнопок.Обычная;
		Кнопка.Действие = Перечисления.кбп_ВидыДействий.Вернуть;
		Кнопка.КомментарийОбязателен = Истина;
		Кнопка.Порядок = 99999;
	КонецЕсли;
	Возврат Кнопки;

КонецФункции

// Кнопки задачи для формы задачи: пусто, если задачу нельзя выполнить.
//
// Параметры:
//  Задача - СправочникСсылка.кбп_Задачи
//
// Возвращаемое значение:
//  см. КнопкиШага
//
Функция КнопкиЗадачи(Задача) Экспорт

	Если Не кбп_Движок.МожноВыполнитьЗадачу(Задача) Тогда
		Возврат НоваяТаблицаКнопок();
	КонецЕсли;
	Кнопки = КнопкиШага(Задача.Шаг);
	КнопкаВозврата = Кнопки.Найти(ИдКнопкиВозврата(), "ИдКнопки");
	Если КнопкаВозврата <> Неопределено И кбп_Движок.ШагиДляВозврата(Задача).Количество() = 0 Тогда
		Кнопки.Удалить(КнопкаВозврата);
	КонецЕсли;

	// Условия видимости и доступности (ФТ-501, ФТ-204): вычисляются по предмету и переменным процесса.
	// Невидимая кнопка убирается, недоступная показывается, но нажать её нельзя.
	Контекст = Неопределено;
	Индекс = Кнопки.Количество() - 1;
	Пока Индекс >= 0 Цикл
		Кнопка = Кнопки[Индекс];
		Индекс = Индекс - 1;
		Кнопка.Доступна = Истина;
		Если Не кбп_Условия.УсловиеЗаполнено(Кнопка.УсловиеВидимости)
			И Не кбп_Условия.УсловиеЗаполнено(Кнопка.УсловиеДоступности) Тогда
			Продолжить;
		КонецЕсли;
		Если Контекст = Неопределено Тогда
			Контекст = кбп_Движок.КонтекстЗадачи(Задача);
		КонецЕсли;
		Если Не КнопкаВидна(Кнопка, Контекст) Тогда
			Кнопки.Удалить(Кнопка);
		Иначе
			Кнопка.Доступна = КнопкаДоступна(Кнопка, Контекст);
		КонецЕсли;
	КонецЦикла;

	// Переадресация, разрешённая на шаге, — отдельной кнопкой, если среди кнопок шага её нет.
	Если Задача.Шаг.РазрешенаПереадресация
		И Кнопки.Найти(Перечисления.кбп_ВидыДействий.Переадресовать, "Действие") = Неопределено Тогда
		Кнопка = Кнопки.Добавить();
		Кнопка.ИдКнопки = ИдКнопкиПереадресации();
		Кнопка.Заголовок = НСтр("ru = 'Переадресовать…'");
		Кнопка.Вид = Перечисления.кбп_ВидыКнопок.Обычная;
		Кнопка.Действие = Перечисления.кбп_ВидыДействий.Переадресовать;
		Кнопка.КомментарийОбязателен = Истина;
		Кнопка.Порядок = 99998;
		Кнопка.Доступна = Истина;
	КонецЕсли;
	Возврат Кнопки;

КонецФункции

// Видна ли кнопка: условие видимости не задано или выполняется.
//
// Параметры:
//  Кнопка - СтрокаТаблицыЗначений - см. КнопкиШага.
//  Контекст - Структура - контекст процесса (кбп_Движок.КонтекстЗадачи).
//
// Возвращаемое значение:
//  Булево
//
Функция КнопкаВидна(Кнопка, Контекст) Экспорт

	Если Не кбп_Условия.УсловиеЗаполнено(Кнопка.УсловиеВидимости) Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат кбп_Условия.ОтборВыполняется(Кнопка.УсловиеВидимости, Контекст);

КонецФункции

// Доступна ли кнопка: условие доступности не задано или выполняется (ФТ-204).
//
// Параметры:
//  Кнопка - СтрокаТаблицыЗначений - см. КнопкиШага.
//  Контекст - Структура - контекст процесса (кбп_Движок.КонтекстЗадачи).
//
// Возвращаемое значение:
//  Булево
//
Функция КнопкаДоступна(Кнопка, Контекст) Экспорт

	Если Не кбп_Условия.УсловиеЗаполнено(Кнопка.УсловиеДоступности) Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат кбп_Условия.ОтборВыполняется(Кнопка.УсловиеДоступности, Контекст);

КонецФункции

// Кнопка, которой задача выполняется автоматически после просрочки (ФТ-308): указанная на шаге,
// иначе первая основная, иначе первая кнопка, которая завершает задачу.
//
// Параметры:
//  Шаг - СправочникСсылка.кбп_ЭлементыСхем
//
// Возвращаемое значение:
//  Строка - ИдКнопки или пустая строка.
//
Функция КнопкаАвтовыполнения(Шаг) Экспорт

	Действия = Перечисления.кбп_ВидыДействий;
	Завершающие = Новый Массив;
	Для Каждого Кнопка Из КнопкиШага(Шаг) Цикл
		Если Кнопка.Действие = Действия.Переход Или Кнопка.Действие = Действия.Завершить
			Или Кнопка.Действие = Действия.Обработчик Тогда
			Завершающие.Добавить(Кнопка);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Кнопка Из Завершающие Цикл
		Если Кнопка.ИдКнопки = Шаг.КнопкаАвтовыполнения Тогда
			Возврат Кнопка.ИдКнопки;
		КонецЕсли;
	КонецЦикла;
	Для Каждого Кнопка Из Завершающие Цикл
		Если Кнопка.Вид = Перечисления.кбп_ВидыКнопок.Основная Тогда
			Возврат Кнопка.ИдКнопки;
		КонецЕсли;
	КонецЦикла;
	Возврат ?(Завершающие.Количество() > 0, Завершающие[0].ИдКнопки, "");

КонецФункции

// Кнопка шага по идентификатору.
//
// Параметры:
//  Шаг - СправочникСсылка.кбп_ЭлементыСхем
//  ИдКнопки - Строка
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - см. КнопкиШага.
//
Функция НайтиКнопку(Шаг, ИдКнопки) Экспорт
	Возврат КнопкиШага(Шаг).Найти(ИдКнопки, "ИдКнопки");
КонецФункции

// Линия, на которую ведёт кнопка с действием «Переход».
//
// Параметры:
//  Шаг - СправочникСсылка.кбп_ЭлементыСхем
//  ИдКнопки - Строка
//
// Возвращаемое значение:
//  Строка - ИдПерехода или пустая строка.
//
Функция ПереходКнопки(Шаг, ИдКнопки) Экспорт

	Кнопка = НайтиКнопку(Шаг, ИдКнопки);
	Если Кнопка = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	Возврат Кнопка.ИдПерехода;

КонецФункции

// Заголовок кнопки для журнала и списков.
//
// Параметры:
//  Шаг - СправочникСсылка.кбп_ЭлементыСхем
//  ИдКнопки - Строка
//
// Возвращаемое значение:
//  Строка
//
Функция ЗаголовокКнопки(Шаг, ИдКнопки) Экспорт

	Если Не ЗначениеЗаполнено(ИдКнопки) Тогда
		Возврат "";
	КонецЕсли;
	Кнопка = НайтиКнопку(Шаг, ИдКнопки);
	Возврат ?(Кнопка = Неопределено, ИдКнопки, Кнопка.Заголовок);

КонецФункции

// Все кнопки задач версии — для выбора «результата» на линиях Условия.
//
// Параметры:
//  Версия - СправочникСсылка.кбп_ВерсииСхем
//
// Возвращаемое значение:
//  СписокЗначений - значение: ИдКнопки, представление: «Шаг: Кнопка».
//
Функция КнопкиВерсии(Версия) Экспорт

	Результат = Новый СписокЗначений;
	Выборка = Справочники.кбп_ЭлементыСхем.Выбрать(, Версия);
	Пока Выборка.Следующий() Цикл
		Если Выборка.ТипШага <> Перечисления.кбп_ТипыШагов.Задача Или Выборка.ПометкаУдаления Или Выборка.НетНаСхеме Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого Кнопка Из КнопкиШага(Выборка.Ссылка) Цикл
			Если Кнопка.Действие = Перечисления.кбп_ВидыДействий.Вернуть Тогда
				Продолжить;
			КонецЕсли;
			Если Результат.НайтиПоЗначению(Кнопка.ИдКнопки) = Неопределено Тогда
				Результат.Добавить(Кнопка.ИдКнопки, СтрШаблон("%1: %2", Выборка.Наименование, Кнопка.Заголовок));
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Идентификатор системной кнопки «Вернуть на доработку».
//
// Возвращаемое значение:
//  Строка
//
Функция ИдКнопкиВозврата() Экспорт
	Возврат "кбп_Возврат";
КонецФункции

// Идентификатор кнопки по умолчанию, когда у задачи одна исходящая линия и кнопки не настроены.
//
// Возвращаемое значение:
//  Строка
//
Функция ИдКнопкиВыполнено() Экспорт
	Возврат "Выполнено";
КонецФункции

// Идентификатор системной кнопки «Переадресовать…» (шаг с разрешённой переадресацией).
//
// Возвращаемое значение:
//  Строка
//
Функция ИдКнопкиПереадресации() Экспорт
	Возврат "кбп_Переадресация";
КонецФункции

// Вызывает зарегистрированный обработчик (Архитектура п. 8.3): Процедура Метод(Контекст) Экспорт.
//
// Параметры:
//  Обработчик - СправочникСсылка.кбп_ОбработчикиПроцессов
//  Контекст - Структура - контекст операции; обработчик может менять Переменные и поля контекста.
//
Процедура ВыполнитьОбработчик(Обработчик, Контекст) Экспорт

	Если Не ЗначениеЗаполнено(Обработчик) Тогда
		Возврат;
	КонецЕсли;
	ИмяМетода = Обработчик.ПолноеИмяМетода;
	Если Не Обработчик.Используется Или Не ЭтоИмяМетода(ИмяМетода) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Обработчик «%1» не зарегистрирован в текущей версии программы.'"), Обработчик);
	КонецЕсли;
	Параметр = Контекст;
	Выполнить(ИмяМетода + "(Параметр)");
	Если Контекст.Свойство("Переменные") Тогда
		Контекст.Вставить("ПеременныеИзменены", Истина);
	КонецЕсли;

КонецПроцедуры

// Обновляет справочник кбп_ОбработчикиПроцессов по кбп_ПроцессыПереопределяемый.ПриРегистрацииОбработчиков.
Процедура ОбновитьОбработчики() Экспорт

	Зарегистрированные = Новый ТаблицаЗначений;
	Зарегистрированные.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка"));
	Зарегистрированные.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Зарегистрированные.Колонки.Добавить("ПолноеИмяМетода", Новый ОписаниеТипов("Строка"));
	Зарегистрированные.Колонки.Добавить("Контекст", Новый ОписаниеТипов("Строка"));
	кбп_ПроцессыПереопределяемый.ПриРегистрацииОбработчиков(Зарегистрированные);

	УстановитьПривилегированныйРежим(Истина);
	Найденные = Новый Соответствие;
	Для Каждого Описание Из Зарегистрированные Цикл
		Если Не ЗначениеЗаполнено(Описание.Имя) Или Не ЭтоИмяМетода(Описание.ПолноеИмяМетода) Тогда
			Продолжить;
		КонецЕсли;
		Ссылка = Справочники.кбп_ОбработчикиПроцессов.НайтиПоРеквизиту("Имя", Описание.Имя);
		Если ЗначениеЗаполнено(Ссылка) Тогда
			Обработчик = Ссылка.ПолучитьОбъект();
		Иначе
			Обработчик = Справочники.кбп_ОбработчикиПроцессов.СоздатьЭлемент();
			Обработчик.Имя = Описание.Имя;
		КонецЕсли;
		Представление = ?(ЗначениеЗаполнено(Описание.Представление), Описание.Представление, Описание.Имя);
		Если Обработчик.Наименование <> Представление Или Обработчик.ПолноеИмяМетода <> Описание.ПолноеИмяМетода
			Или Обработчик.Контекст <> Описание.Контекст Или Не Обработчик.Используется Или Обработчик.ПометкаУдаления Тогда
			Обработчик.Наименование = Представление;
			Обработчик.ПолноеИмяМетода = Описание.ПолноеИмяМетода;
			Обработчик.Контекст = Описание.Контекст;
			Обработчик.Используется = Истина;
			Обработчик.ПометкаУдаления = Ложь;
			Обработчик.Записать();
		КонецЕсли;
		Найденные.Вставить(Обработчик.Ссылка, Истина);
	КонецЦикла;

	Выборка = Справочники.кбп_ОбработчикиПроцессов.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Найденные[Выборка.Ссылка] = Неопределено И Выборка.Используется Тогда
			Обработчик = Выборка.ПолучитьОбъект();
			Обработчик.Используется = Ложь;
			Обработчик.Записать();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НоваяТаблицаКнопок()

	Кнопки = Новый ТаблицаЗначений;
	Кнопки.Колонки.Добавить("ИдКнопки", Новый ОписаниеТипов("Строка"));
	Кнопки.Колонки.Добавить("Заголовок", Новый ОписаниеТипов("Строка"));
	Кнопки.Колонки.Добавить("Вид", Новый ОписаниеТипов("ПеречислениеСсылка.кбп_ВидыКнопок"));
	Кнопки.Колонки.Добавить("Действие", Новый ОписаниеТипов("ПеречислениеСсылка.кбп_ВидыДействий"));
	Кнопки.Колонки.Добавить("ИдПерехода", Новый ОписаниеТипов("Строка"));
	Кнопки.Колонки.Добавить("Подтверждение", Новый ОписаниеТипов("Булево"));
	Кнопки.Колонки.Добавить("ТекстПодтверждения", Новый ОписаниеТипов("Строка"));
	Кнопки.Колонки.Добавить("КомментарийОбязателен", Новый ОписаниеТипов("Булево"));
	Кнопки.Колонки.Добавить("Обработчик", Новый ОписаниеТипов("СправочникСсылка.кбп_ОбработчикиПроцессов"));
	Кнопки.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	Кнопки.Колонки.Добавить("ИмяФормы", Новый ОписаниеТипов("Строка"));
	Кнопки.Колонки.Добавить("ВложеннаяСхема", Новый ОписаниеТипов("СправочникСсылка.кбп_СхемыПроцессов"));
	Кнопки.Колонки.Добавить("УсловиеВидимости");
	Кнопки.Колонки.Добавить("УсловиеДоступности");
	Кнопки.Колонки.Добавить("Доступна", Новый ОписаниеТипов("Булево"));
	Возврат Кнопки;

КонецФункции

// Кнопки «по линиям»: если из задачи несколько линий без условий — каждая линия становится кнопкой.
Процедура ДобавитьКнопкиПоЛиниям(Кнопки, Шаг)

	Выходы = кбп_Движок.ВыходыШага(Шаг);
	ПоЛиниям = Выходы.Количество() > 1;
	Для Каждого Выход Из Выходы Цикл
		Если Выход.ВидУсловия <> Перечисления.кбп_ВидыУсловий.Нет И ЗначениеЗаполнено(Выход.ВидУсловия)
			Или ЗначениеЗаполнено(Выход.ИдКнопки) Тогда
			ПоЛиниям = Ложь;
		КонецЕсли;
	КонецЦикла;

	Если Не ПоЛиниям Тогда
		Кнопка = Кнопки.Добавить();
		Кнопка.ИдКнопки = ИдКнопкиВыполнено();
		Кнопка.Заголовок = НСтр("ru = 'Выполнено'");
		Кнопка.Вид = Перечисления.кбп_ВидыКнопок.Основная;
		Кнопка.Действие = Перечисления.кбп_ВидыДействий.Завершить;
		Возврат;
	КонецЕсли;

	Для Каждого Выход Из Выходы Цикл
		Кнопка = Кнопки.Добавить();
		Кнопка.ИдКнопки = Выход.ИдПерехода;
		Кнопка.ИдПерехода = Выход.ИдПерехода;
		Кнопка.Заголовок = ?(ЗначениеЗаполнено(Выход.Наименование), Выход.Наименование,
			СтрШаблон(НСтр("ru = 'Далее: %1'"), Выход.Куда));
		Кнопка.Вид = ?(Кнопки.Количество() = 1, Перечисления.кбп_ВидыКнопок.Основная, Перечисления.кбп_ВидыКнопок.Обычная);
		Кнопка.Действие = Перечисления.кбп_ВидыДействий.Переход;
		Кнопка.Порядок = Выход.Порядок;
	КонецЦикла;

КонецПроцедуры

// «ОбщийМодуль.Метод»: модуль существует, имя метода — идентификатор.
Функция ЭтоИмяМетода(ИмяМетода)

	Части = СтрРазделить(ИмяМетода, ".");
	Если Части.Количество() <> 2 Или Метаданные.ОбщиеМодули.Найти(Части[0]) = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Попытка
		Проверка = Новый Структура(Части[1]);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	Возврат Проверка.Количество() = 1;

КонецФункции

#КонецОбласти
